## Instalação das Dependências

O projeto utiliza o pacote `pandas` para manipulação de dados. Para instalar as dependências, utilizei o ambiente `conda` executando o seguinte comando:

```sh
conda install pandas

In [2]:
import pandas as pd

In [3]:
#Leitura dos arquivos
airbnb_price = pd.read_csv("airbnb_price.csv")
airbnb_last_review = pd.read_csv("airbnb_last_review.tsv", sep="\t")
airbnb_room_type = pd.read_excel("airbnb_room_type.xlsx")

In [ ]:
#Visualização das tabelas lidas utilizando a função head(), que mostra as primeiras linhas (5 por padrão) e todas as colunas da tabela.
airbnb_price.head()

   listing_id        price                nbhood_full
0        2595  225 dollars         Manhattan, Midtown
1        3831   89 dollars     Brooklyn, Clinton Hill
2        5099  200 dollars     Manhattan, Murray Hill
3        5178   79 dollars  Manhattan, Hell's Kitchen
4        5238  150 dollars       Manhattan, Chinatown

In [5]:
airbnb_last_review.head()

   listing_id    host_name   last_review
0        2595     Jennifer   May 21 2019
1        3831  LisaRoxanne  July 05 2019
2        5099        Chris  June 22 2019
3        5178     Shunichi  June 24 2019
4        5238          Ben  June 09 2019

In [6]:
airbnb_room_type.head()

   listing_id                                description        room_type
0        2595                      Skylit Midtown Castle  Entire home/apt
1        3831            Cozy Entire Floor of Brownstone  Entire home/apt
2        5099  Large Cozy 1 BR Apartment In Midtown East  Entire home/apt
3        5178            Large Furnished Room Near B'way     private room
4        5238         Cute & Cozy Lower East Side 1 bdrm  Entire home/apt

In [7]:
listings = pd.merge(airbnb_price, airbnb_room_type, on='listing_id')
listings = pd.merge(listings, airbnb_last_review, on='listing_id')

In [18]:
listings.head()

,listing_id,price,nbhood_full,description,room_type,host_name,last_review,last_review_date,price_clean
0,2595,225 dollars,"Manhattan, Midtown",Skylit Midtown Castle,entire home/apt,Jennifer,May 21 2019,2019-05-21,225.0
1,3831,89 dollars,"Brooklyn, Clinton Hill",Cozy Entire Floor of Brownstone,entire home/apt,LisaRoxanne,July 05 2019,2019-07-05,89.0
2,5099,200 dollars,"Manhattan, Murray Hill",Large Cozy 1 BR Apartment In Midtown East,entire home/apt,Chris,June 22 2019,2019-06-22,200.0
3,5178,79 dollars,"Manhattan, Hell's Kitchen",Large Furnished Room Near B'way,private room,Shunichi,June 24 2019,2019-06-24,79.0
4,5238,150 dollars,"Manhattan, Chinatown",Cute & Cozy Lower East Side 1 bdrm,entire home/apt,Ben,June 09 2019,2019-06-09,150.0

In [ ]:
#Datas das avaliações mais recentes 
#uso da função max e min
listings['last_review_date'] = pd.to_datetime(listings['last_review'], format='%B %d %Y') #convertendo o formato da data
first_reviewed = listings['last_review_date'].min() #utilização da função min, que pega o valor minimo
last_reviewed = listings['last_review_date'].max()  #utilização da função max, que pega o valor máximo
print(f"A data da última avaliação é: {last_reviewed} e, a primeira é: {first_reviewed}")

A data da última avaliação é: 2019-07-09 00:00:00 e, a primeira é 2019-01-01 00:00:00

In [ ]:
#Quantas salas são consideradas privadas
listings['room_type'] = listings['room_type'].str.lower() #convertendo todas as strings desta tabela para minúsculo
private_room_count = listings[listings['room_type'] == 'private room'].shape[0] #contando a quantidade de vezes que a string "private room" aparece
print(f"Número de salas privadas: {private_room_count}")

Número de salas privadas: 11356

In [ ]:
#Preço médio da lista de valores.
listings['price_clean'] = listings['price'].str.replace(' dollars', '').astype(float) #selecionando a coluna price cleans e trocando a string dollars para vazio.
avg_price = listings['price_clean'].mean() #utilizando a função mean para capturar a média dos valores contidos na coluna price_clean
print(f"O preço médio é de: {avg_price}")

O preço médio é de: 141.7779364512674

In [19]:
#Criando um dataframe utilizando colunas criadas anteriormente.
review_dates = pd.DataFrame({
    'first_reviewed': [first_reviewed],
    'last_reviewed': [last_reviewed],
    'nb_private_rooms': [private_room_count],
    'avg_price': [round(avg_price, 2)]
})

In [21]:
review_dates

  first_reviewed last_reviewed  nb_private_rooms  avg_price
0     2019-01-01    2019-07-09             11356     141.78